//---------------------------------------------------------------------------
#include <vcl.h>
#ifndef Function_UnitH
#define Function_UnitH
//---------------------------------------------------------------------------
union RL     // R_char и R_int используют один и тот же участок памяти
            // и применяются в том или ином виде
{
 unsigned char R_char[4];
 unsigned  int R_int;
};
//---------------------------------------------------------------------------
char * LoadFromFile(char* FileName, DWORD* DlinaFile);
//---------------------------------------------------------------------------
void SaveFile(char *FileName, char *str, DWORD &DlinaFaila);
//---------------------------------------------------------------------------
#endif
